summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_regdef.h
/** \\brief  GTU Configuration Register 2 */
typedef struct _Ifx_ERAY_GTUC02_Bits
{
    unsigned int MPC:14;                    /**< \brief [13:0] Macrotick Per Cycle (gMacroPerCycle)This bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SNM:4;                     /**< \brief [19:16] Sync Node Max (gSyncNodeMax) (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC02_Bits;

/** \\brief  GTU Configuration Register 3 */
typedef struct _Ifx_ERAY_GTUC03_Bits
{
    unsigned int UIOA:8;                    /**< \brief [7:0] Microtick Initial Offset Channel AThis bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (pMicroInitialOffset[A]) (rw) */
    unsigned int UIOB:8;                    /**< \brief [15:8] Microtick Initial Offset Channel B (pMicroInitialOffset[B]) (rw) */
    unsigned int MIOA:7;                    /**< \brief [22:16] Macrotick Initial Offset Channel A (gMacroInitialOffset[A]) (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int MIOB:7;                    /**< \brief [30:24] Macrotick Initial Offset Channel B (gMacroInitialOffset[B]) (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC03_Bits;

/** \\brief  GTU Configuration Register 4 */
typedef struct _Ifx_ERAY_GTUC04_Bits
{
    unsigned int NIT:14;                    /**< \brief [13:0] Network Idle Time Start This bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (gMacroPerCycle - gdNIT - 1) (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int OCS:14;                    /**< \brief [29:16] Offset Correction Start (gOffsetCorrectionStart - 1) (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC04_Bits;

/** \\brief  GTU Configuration Register 5 */
typedef struct _Ifx_ERAY_GTUC05_Bits
{
    unsigned int DCA:8;                     /**< \brief [7:0] Delay Compensation Channel AThis bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (pDelayCompensation[A]) (rw) */
    unsigned int DCB:8;                     /**< \brief [15:8] Delay Compensation Channel B (pDelayCompensation[B]) (rw) */
    unsigned int CDD:5;                     /**< \brief [20:16] Cluster Drift Damping (pClusterDriftDamping) (rw) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int DEC:8;                     /**< \brief [31:24] Decoding Correction (pDecodingCorrection) (rw) */
} Ifx_ERAY_GTUC05_Bits;

/** \\brief  GTU Configuration Register 6 */
typedef struct _Ifx_ERAY_GTUC06_Bits
{
    unsigned int ASR:11;                    /**< \brief [10:0] Accepted Startup RangeThis bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (pdAcceptedStartupRange) (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int MOD:11;                    /**< \brief [26:16] Maximum Oscillator Drift (pdMaxDrift) (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC06_Bits;

/** \\brief  GTU Configuration Register 7 */
typedef struct _Ifx_ERAY_GTUC07_Bits
{
    unsigned int SSL:10;                    /**< \brief [9:0] Static Slot Length (gdStaticSlot)This bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int NSS:10;                    /**< \brief [25:16] Number of Static Slots (gNumberOfStaticSlots) (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC07_Bits;

/** \\brief  GTU Configuration Register 8 */
typedef struct _Ifx_ERAY_GTUC08_Bits
{
    unsigned int MSL:6;                     /**< \brief [5:0] Minislot Length (gdMinislot)This bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int NMS:13;                    /**< \brief [28:16] Number of Minislots (gNumberOfMinislots) (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC08_Bits;

/** \\brief  GTU Configuration Register 9 */
typedef struct _Ifx_ERAY_GTUC09_Bits
{
    unsigned int APO:6;                     /**< \brief [5:0] Action Point Offset (gdActionPointOffset)This bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int MAPO:5;                    /**< \brief [12:8] Minislot Action Point Offset (gd Minislot Action Point Offset) (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int DSI:2;                     /**< \brief [17:16] Dynamic Slot Idle Phase (gdDynamicSlotIdlePhase) (rw) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC09_Bits;

/** \\brief  GTU Configuration Register 10 */
typedef struct _Ifx_ERAY_GTUC10_Bits
{
    unsigned int MOC:14;                    /**< \brief [13:0] Maximum Offset CorrectionThis bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (pOffsetCorrectionOut) (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int MRC:11;                    /**< \brief [26:16] Maximum Rate Correction (pRateCorrectionOut) (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC10_Bits;

/** \\brief  GTU Configuration Register 11 */
typedef struct _Ifx_ERAY_GTUC11_Bits
{
    unsigned int EOCC:2;                    /**< \brief [1:0] External Offset Correction Control (pExternOffsetControl) (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int ERCC:2;                    /**< \brief [9:8] External Rate Correction Control (pExternRateControl) (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int EOC:3;                     /**< \brief [18:16] External Offset CorrectionThis bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (pExternOffsetCorrection) (rw) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int ERC:3;                     /**< \brief [26:24] External Rate Correction (pExternRateCorrection) (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC11_Bits;

/** \\brief  Input Buffer Command Mask */
typedef struct _Ifx_ERAY_IBCM_Bits
{
    unsigned int LHSH:1;                    /**< \brief [0:0] Load Header Section Host (rwh) */
    unsigned int LDSH:1;                    /**< \brief [1:1] Load Data Section Host (rwh) */
    unsigned int STXRH:1;                   /**< \brief [2:2] Set Transmission Request Host (rwh) */
    unsigned int reserved_3:13;             /**< \brief \internal Reserved */
    unsigned int LHSS:1;                    /**< \brief [16:16] Load Header Section Shadow (rh) */
    unsigned int LDSS:1;                    /**< \brief [17:17] Load Data Section Shadow (rh) */
    unsigned int STXRS:1;                   /**< \brief [18:18] Transmission Request Shadow (rh) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_ERAY_IBCM_Bits;

/** \\brief  Input Buffer Command Request */
typedef struct _Ifx_ERAY_IBCR_Bits
{
    unsigned int IBRH:7;                    /**< \brief [6:0] Input Buffer Request Host (rwh) */
    unsigned int reserved_7:8;              /**< \brief \internal Reserved */
    unsigned int IBSYH:1;                   /**< \brief [15:15] Input Buffer Busy Host (rh) */
    unsigned int IBRS:7;                    /**< \brief [22:16] Input Buffer Request Shadow (rh) */
    unsigned int reserved_23:8;             /**< \brief \internal Reserved */
    unsigned int IBSYS:1;                   /**< \brief [31:31] Input Buffer Busy Shadow (rh) */
} Ifx_ERAY_IBCR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_ERAY_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_ERAY_ID_Bits;

/** \\brief  Service Request Line Enable */
typedef struct _Ifx_ERAY_ILE_Bits
{
    unsigned int EINT0:1;                   /**< \brief [0:0] Enable Service Request Line 0 (INT0SRC) (rw) */
    unsigned int EINT1:1;                   /**< \brief [1:1] Enable Service Request Line 1 (INT1SRC) (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_ERAY_ILE_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_ERAY_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_ERAY_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_ERAY_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_ERAY_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_ERAY_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_ERAY_KRSTCLR_Bits;

/** \\brief  Lock Register */
typedef struct _Ifx_ERAY_LCK_Bits
{
    unsigned int CLK:8;                     /**< \brief [7:0] Configuration Lock Key (w) */
    unsigned int TMK:8;                     /**< \brief [15:8] Test Mode Key (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_LCK_Bits;

/** \\brief  Last Dynamic Transmit Slot */
typedef struct _Ifx_ERAY_LDTS_Bits
{
    unsigned int LDTA:11;                   /**< \brief [10:0] Last Dynamic Transmission Channel A (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int LDTB:11;                   /**< \brief [26:16] Last Dynamic Transmission Channel B (rh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_LDTS_Bits;

