summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_regdef.h
/** \\brief  Message Buffer Status Changed Interrupt Control 4 */
typedef struct _Ifx_ERAY_MSIC4_Bits
{
    unsigned int MSIP96:1;                  /**< \brief [0:0] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP97:1;                  /**< \brief [1:1] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP98:1;                  /**< \brief [2:2] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP99:1;                  /**< \brief [3:3] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP100:1;                 /**< \brief [4:4] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP101:1;                 /**< \brief [5:5] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP102:1;                 /**< \brief [6:6] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP103:1;                 /**< \brief [7:7] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP104:1;                 /**< \brief [8:8] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP105:1;                 /**< \brief [9:9] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP106:1;                 /**< \brief [10:10] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP107:1;                 /**< \brief [11:11] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP108:1;                 /**< \brief [12:12] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP109:1;                 /**< \brief [13:13] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP110:1;                 /**< \brief [14:14] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP111:1;                 /**< \brief [15:15] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP112:1;                 /**< \brief [16:16] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP113:1;                 /**< \brief [17:17] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP114:1;                 /**< \brief [18:18] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP115:1;                 /**< \brief [19:19] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP116:1;                 /**< \brief [20:20] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP117:1;                 /**< \brief [21:21] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP118:1;                 /**< \brief [22:22] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP119:1;                 /**< \brief [23:23] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP120:1;                 /**< \brief [24:24] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP121:1;                 /**< \brief [25:25] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP122:1;                 /**< \brief [26:26] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP123:1;                 /**< \brief [27:27] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP124:1;                 /**< \brief [28:28] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP125:1;                 /**< \brief [29:29] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP126:1;                 /**< \brief [30:30] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
    unsigned int MSIP127:1;                 /**< \brief [31:31] Message Buffer Status Changed Interrupt Pointern (n=96-127) (rw) */
} Ifx_ERAY_MSIC4_Bits;

/** \\brief  Macrotick and Cycle Counter Value */
typedef struct _Ifx_ERAY_MTCCV_Bits
{
    unsigned int MTV:14;                    /**< \brief [13:0] Macrotick Value (vMacrotick) (rh) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int CCV:6;                     /**< \brief [21:16] Cycle Counter Value (vCycleCounter) (rh) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_ERAY_MTCCV_Bits;

/** \\brief  New Data Register 1 */
typedef struct _Ifx_ERAY_NDAT1_Bits
{
    unsigned int ND0:1;                     /**< \brief [0:0] New Data n (n=0-31) (rh) */
    unsigned int ND1:1;                     /**< \brief [1:1] New Data n (n=0-31) (rh) */
    unsigned int ND2:1;                     /**< \brief [2:2] New Data n (n=0-31) (rh) */
    unsigned int ND3:1;                     /**< \brief [3:3] New Data n (n=0-31) (rh) */
    unsigned int ND4:1;                     /**< \brief [4:4] New Data n (n=0-31) (rh) */
    unsigned int ND5:1;                     /**< \brief [5:5] New Data n (n=0-31) (rh) */
    unsigned int ND6:1;                     /**< \brief [6:6] New Data n (n=0-31) (rh) */
    unsigned int ND7:1;                     /**< \brief [7:7] New Data n (n=0-31) (rh) */
    unsigned int ND8:1;                     /**< \brief [8:8] New Data n (n=0-31) (rh) */
    unsigned int ND9:1;                     /**< \brief [9:9] New Data n (n=0-31) (rh) */
    unsigned int ND10:1;                    /**< \brief [10:10] New Data n (n=0-31) (rh) */
    unsigned int ND11:1;                    /**< \brief [11:11] New Data n (n=0-31) (rh) */
    unsigned int ND12:1;                    /**< \brief [12:12] New Data n (n=0-31) (rh) */
    unsigned int ND13:1;                    /**< \brief [13:13] New Data n (n=0-31) (rh) */
    unsigned int ND14:1;                    /**< \brief [14:14] New Data n (n=0-31) (rh) */
    unsigned int ND15:1;                    /**< \brief [15:15] New Data n (n=0-31) (rh) */
    unsigned int ND16:1;                    /**< \brief [16:16] New Data n (n=0-31) (rh) */
    unsigned int ND17:1;                    /**< \brief [17:17] New Data n (n=0-31) (rh) */
    unsigned int ND18:1;                    /**< \brief [18:18] New Data n (n=0-31) (rh) */
    unsigned int ND19:1;                    /**< \brief [19:19] New Data n (n=0-31) (rh) */
    unsigned int ND20:1;                    /**< \brief [20:20] New Data n (n=0-31) (rh) */
    unsigned int ND21:1;                    /**< \brief [21:21] New Data n (n=0-31) (rh) */
    unsigned int ND22:1;                    /**< \brief [22:22] New Data n (n=0-31) (rh) */
    unsigned int ND23:1;                    /**< \brief [23:23] New Data n (n=0-31) (rh) */
    unsigned int ND24:1;                    /**< \brief [24:24] New Data n (n=0-31) (rh) */
    unsigned int ND25:1;                    /**< \brief [25:25] New Data n (n=0-31) (rh) */
    unsigned int ND26:1;                    /**< \brief [26:26] New Data n (n=0-31) (rh) */
    unsigned int ND27:1;                    /**< \brief [27:27] New Data n (n=0-31) (rh) */
    unsigned int ND28:1;                    /**< \brief [28:28] New Data n (n=0-31) (rh) */
    unsigned int ND29:1;                    /**< \brief [29:29] New Data n (n=0-31) (rh) */
    unsigned int ND30:1;                    /**< \brief [30:30] New Data n (n=0-31) (rh) */
    unsigned int ND31:1;                    /**< \brief [31:31] New Data n (n=0-31) (rh) */
} Ifx_ERAY_NDAT1_Bits;

