summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_regdef.h
/** \\brief  New Data Register 2 */
typedef struct _Ifx_ERAY_NDAT2_Bits
{
    unsigned int ND32:1;                    /**< \brief [0:0] New Data n (n=32-63) (rh) */
    unsigned int ND33:1;                    /**< \brief [1:1] New Data n (n=32-63) (rh) */
    unsigned int ND34:1;                    /**< \brief [2:2] New Data n (n=32-63) (rh) */
    unsigned int ND35:1;                    /**< \brief [3:3] New Data n (n=32-63) (rh) */
    unsigned int ND36:1;                    /**< \brief [4:4] New Data n (n=32-63) (rh) */
    unsigned int ND37:1;                    /**< \brief [5:5] New Data n (n=32-63) (rh) */
    unsigned int ND38:1;                    /**< \brief [6:6] New Data n (n=32-63) (rh) */
    unsigned int ND39:1;                    /**< \brief [7:7] New Data n (n=32-63) (rh) */
    unsigned int ND40:1;                    /**< \brief [8:8] New Data n (n=32-63) (rh) */
    unsigned int ND41:1;                    /**< \brief [9:9] New Data n (n=32-63) (rh) */
    unsigned int ND42:1;                    /**< \brief [10:10] New Data n (n=32-63) (rh) */
    unsigned int ND43:1;                    /**< \brief [11:11] New Data n (n=32-63) (rh) */
    unsigned int ND44:1;                    /**< \brief [12:12] New Data n (n=32-63) (rh) */
    unsigned int ND45:1;                    /**< \brief [13:13] New Data n (n=32-63) (rh) */
    unsigned int ND46:1;                    /**< \brief [14:14] New Data n (n=32-63) (rh) */
    unsigned int ND47:1;                    /**< \brief [15:15] New Data n (n=32-63) (rh) */
    unsigned int ND48:1;                    /**< \brief [16:16] New Data n (n=32-63) (rh) */
    unsigned int ND49:1;                    /**< \brief [17:17] New Data n (n=32-63) (rh) */
    unsigned int ND50:1;                    /**< \brief [18:18] New Data n (n=32-63) (rh) */
    unsigned int ND51:1;                    /**< \brief [19:19] New Data n (n=32-63) (rh) */
    unsigned int ND52:1;                    /**< \brief [20:20] New Data n (n=32-63) (rh) */
    unsigned int ND53:1;                    /**< \brief [21:21] New Data n (n=32-63) (rh) */
    unsigned int ND54:1;                    /**< \brief [22:22] New Data n (n=32-63) (rh) */
    unsigned int ND55:1;                    /**< \brief [23:23] New Data n (n=32-63) (rh) */
    unsigned int ND56:1;                    /**< \brief [24:24] New Data n (n=32-63) (rh) */
    unsigned int ND57:1;                    /**< \brief [25:25] New Data n (n=32-63) (rh) */
    unsigned int ND58:1;                    /**< \brief [26:26] New Data n (n=32-63) (rh) */
    unsigned int ND59:1;                    /**< \brief [27:27] New Data n (n=32-63) (rh) */
    unsigned int ND60:1;                    /**< \brief [28:28] New Data n (n=32-63) (rh) */
    unsigned int ND61:1;                    /**< \brief [29:29] New Data n (n=32-63) (rh) */
    unsigned int ND62:1;                    /**< \brief [30:30] New Data n (n=32-63) (rh) */
    unsigned int ND63:1;                    /**< \brief [31:31] New Data n (n=32-63) (rh) */
} Ifx_ERAY_NDAT2_Bits;

/** \\brief  New Data Register 3 */
typedef struct _Ifx_ERAY_NDAT3_Bits
{
    unsigned int ND64:1;                    /**< \brief [0:0] New Data n (n=64-95) (rh) */
    unsigned int ND65:1;                    /**< \brief [1:1] New Data n (n=64-95) (rh) */
    unsigned int ND66:1;                    /**< \brief [2:2] New Data n (n=64-95) (rh) */
    unsigned int ND67:1;                    /**< \brief [3:3] New Data n (n=64-95) (rh) */
    unsigned int ND68:1;                    /**< \brief [4:4] New Data n (n=64-95) (rh) */
    unsigned int ND69:1;                    /**< \brief [5:5] New Data n (n=64-95) (rh) */
    unsigned int ND70:1;                    /**< \brief [6:6] New Data n (n=64-95) (rh) */
    unsigned int ND71:1;                    /**< \brief [7:7] New Data n (n=64-95) (rh) */
    unsigned int ND72:1;                    /**< \brief [8:8] New Data n (n=64-95) (rh) */
    unsigned int ND73:1;                    /**< \brief [9:9] New Data n (n=64-95) (rh) */
    unsigned int ND74:1;                    /**< \brief [10:10] New Data n (n=64-95) (rh) */
    unsigned int ND75:1;                    /**< \brief [11:11] New Data n (n=64-95) (rh) */
    unsigned int ND76:1;                    /**< \brief [12:12] New Data n (n=64-95) (rh) */
    unsigned int ND77:1;                    /**< \brief [13:13] New Data n (n=64-95) (rh) */
    unsigned int ND78:1;                    /**< \brief [14:14] New Data n (n=64-95) (rh) */
    unsigned int ND79:1;                    /**< \brief [15:15] New Data n (n=64-95) (rh) */
    unsigned int ND80:1;                    /**< \brief [16:16] New Data n (n=64-95) (rh) */
    unsigned int ND81:1;                    /**< \brief [17:17] New Data n (n=64-95) (rh) */
    unsigned int ND82:1;                    /**< \brief [18:18] New Data n (n=64-95) (rh) */
    unsigned int ND83:1;                    /**< \brief [19:19] New Data n (n=64-95) (rh) */
    unsigned int ND84:1;                    /**< \brief [20:20] New Data n (n=64-95) (rh) */
    unsigned int ND85:1;                    /**< \brief [21:21] New Data n (n=64-95) (rh) */
    unsigned int ND86:1;                    /**< \brief [22:22] New Data n (n=64-95) (rh) */
    unsigned int ND87:1;                    /**< \brief [23:23] New Data n (n=64-95) (rh) */
    unsigned int ND88:1;                    /**< \brief [24:24] New Data n (n=64-95) (rh) */
    unsigned int ND89:1;                    /**< \brief [25:25] New Data n (n=64-95) (rh) */
    unsigned int ND90:1;                    /**< \brief [26:26] New Data n (n=64-95) (rh) */
    unsigned int ND91:1;                    /**< \brief [27:27] New Data n (n=64-95) (rh) */
    unsigned int ND92:1;                    /**< \brief [28:28] New Data n (n=64-95) (rh) */
    unsigned int ND93:1;                    /**< \brief [29:29] New Data n (n=64-95) (rh) */
    unsigned int ND94:1;                    /**< \brief [30:30] New Data n (n=64-95) (rh) */
    unsigned int ND95:1;                    /**< \brief [31:31] New Data n (n=64-95) (rh) */
} Ifx_ERAY_NDAT3_Bits;

