summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_regdef.h
/** \\brief  SUC Configuration Register 2 */
typedef struct _Ifx_ERAY_SUCC2_Bits
{
    unsigned int LT:21;                     /**< \brief [20:0] Listen TimeoutThis bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (pdListenTimeout) (rw) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int LTN:4;                     /**< \brief [27:24] Listen Time-out Noise (gListenNoise - 1) (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_ERAY_SUCC2_Bits;

/** \\brief  SUC Configuration Register 3 */
typedef struct _Ifx_ERAY_SUCC3_Bits
{
    unsigned int WCP:4;                     /**< \brief [3:0] Maximum Without Clock Correction PassiveThis bit can be updated in "DEFAULT_CONFIG" or "CONFIG" state only! (gMaxWithoutClockCorrectionPassive) (rw) */
    unsigned int WCF:4;                     /**< \brief [7:4] Maximum Without Clock Correction Fatal (gMaxWithoutClockCorrecti on Fatal) (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_ERAY_SUCC3_Bits;

/** \\brief  Symbol Window and Network Idle Time Status */
typedef struct _Ifx_ERAY_SWNIT_Bits
{
    unsigned int SESA:1;                    /**< \brief [0:0] Syntax Error in Symbol Window Channel A (vSS!SyntaxErrorA) (rh) */
    unsigned int SBSA:1;                    /**< \brief [1:1] Slot Boundary Violation in Symbol Window Channel A (vSS!BViolationA) (rh) */
    unsigned int TCSA:1;                    /**< \brief [2:2] Transmission Conflict in Symbol Window Channel A (vSS!TxConflictA) (rh) */
    unsigned int SESB:1;                    /**< \brief [3:3] Syntax Error in Symbol Window Channel B (vSS!SyntaxErrorB) (rh) */
    unsigned int SBSB:1;                    /**< \brief [4:4] Slot Boundary Violation in Symbol Window Channel B (vSS!BViolationB) (rh) */
    unsigned int TCSB:1;                    /**< \brief [5:5] Transmission Conflict in Symbol Window Channel B (vSS!TxConflictB) (rh) */
    unsigned int MTSA:1;                    /**< \brief [6:6] MTS Received on Channel A (vSS!ValidMTSA)MTSA and MTSB may also be changed outside "DEFAULT_CONFIG" or "CONFIG" state when the write to SUCC1 register is directly preceded by the unlock sequence as described in "Lock Register (LCK)". This may be combined with CHI command SEND_MTS. If both bits MTSA and MTSB are set to 1 an MTS symbol will be transmitted on both channels when requested by writing SUCC1.CMD=1000B. (rh) */
    unsigned int MTSB:1;                    /**< \brief [7:7] MTS Received on Channel B (vSS!ValidMTSB) (rh) */
    unsigned int SENA:1;                    /**< \brief [8:8] Syntax Error during network idle time (NIT) Channel A (vSS!SyntaxErrorA) (rh) */
    unsigned int SBNA:1;                    /**< \brief [9:9] Slot Boundary Violation during network idle time (NIT) Channel A (vSS!BViolationA) (rh) */
    unsigned int SENB:1;                    /**< \brief [10:10] Syntax Error during network idle time (NIT) Channel B (vSS!SyntaxErrorB) (rh) */
    unsigned int SBNB:1;                    /**< \brief [11:11] Slot Boundary Violation during network idle time (NIT) Channel B (vSS!BViolationB) (rh) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_ERAY_SWNIT_Bits;

/** \\brief  Timer 0 Configuration */
typedef struct _Ifx_ERAY_T0C_Bits
{
    unsigned int T0RC:1;                    /**< \brief [0:0] Timer 0 Run Control (rwh) */
    unsigned int T0MS:1;                    /**< \brief [1:1] Timer 0 Mode Select (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int T0CC:7;                    /**< \brief [14:8] Timer 0 Cycle Code (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int T0MO:14;                   /**< \brief [29:16] Timer 0 Macrotick Offset (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_T0C_Bits;

/** \\brief  Timer 1 Configuration */
typedef struct _Ifx_ERAY_T1C_Bits
{
    unsigned int T1RC:1;                    /**< \brief [0:0] Timer 1 Run Control (rwh) */
    unsigned int T1MS:1;                    /**< \brief [1:1] Timer 1 Mode Select (rw) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int T1MC:14;                   /**< \brief [29:16] Timer 1 Macrotick Count (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_T1C_Bits;

/** \\brief  Test Register 1 */
typedef struct _Ifx_ERAY_TEST1_Bits
{
    unsigned int WRTEN:1;                   /**< \brief [0:0] Write Test Register Enable (rw) */
    unsigned int ELBE:1;                    /**< \brief [1:1] External Loop Back Enable (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int TMC:2;                     /**< \brief [5:4] Test Multiplexer Control (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int AOA:1;                     /**< \brief [8:8] Activity on A (rh) */
    unsigned int AOB:1;                     /**< \brief [9:9] Activity on B (rh) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int RXA:1;                     /**< \brief [16:16] Read Channel A Receive Pin (rh) */
    unsigned int RXB:1;                     /**< \brief [17:17] Read Channel B Receive Pin (rh) */
    unsigned int TXA:1;                     /**< \brief [18:18] Read or Write to Channel A Transmit Pin (rwh) */
    unsigned int TXB:1;                     /**< \brief [19:19] Read or Write to Channel B Transmit Pin (rwh) */
    unsigned int TXENA:1;                   /**< \brief [20:20] Read or Write to Channel A Transmit Enable Pin (rwh) */
    unsigned int TXENB:1;                   /**< \brief [21:21] Read or Write to Channel B Transmit Enable Pin (rwh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int CERA:4;                    /**< \brief [27:24] Coding Error Report Channel ACoding errors are also signalled when the Communication Controller is in "MONITOR_MODE". The error codes regarding CAS / MTS symbols concern only the monitored bit pattern, irrelevant whether those bit patterns are seen in the symbol window or elsewhere. (rh) */
    unsigned int CERB:4;                    /**< \brief [31:28] Coding Error Report Channel B (rh) */
} Ifx_ERAY_TEST1_Bits;

/** \\brief  Test Register 2 */
typedef struct _Ifx_ERAY_TEST2_Bits
{
    unsigned int RS:3;                      /**< \brief [2:0] RAM Select (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int SSEL:3;                    /**< \brief [6:4] Segment Select (rw) */
    unsigned int reserved_7:7;              /**< \brief \internal Reserved */
    unsigned int WRECC:1;                   /**< \brief [14:14] Write ECC Data Enable (rw) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_ERAY_TEST2_Bits;

/** \\brief  Transmission Request Register 1 */
typedef struct _Ifx_ERAY_TXRQ1_Bits
{
    unsigned int TXR0:1;                    /**< \brief [0:0] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR1:1;                    /**< \brief [1:1] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR2:1;                    /**< \brief [2:2] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR3:1;                    /**< \brief [3:3] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR4:1;                    /**< \brief [4:4] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR5:1;                    /**< \brief [5:5] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR6:1;                    /**< \brief [6:6] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR7:1;                    /**< \brief [7:7] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR8:1;                    /**< \brief [8:8] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR9:1;                    /**< \brief [9:9] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR10:1;                   /**< \brief [10:10] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR11:1;                   /**< \brief [11:11] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR12:1;                   /**< \brief [12:12] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR13:1;                   /**< \brief [13:13] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR14:1;                   /**< \brief [14:14] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR15:1;                   /**< \brief [15:15] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR16:1;                   /**< \brief [16:16] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR17:1;                   /**< \brief [17:17] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR18:1;                   /**< \brief [18:18] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR19:1;                   /**< \brief [19:19] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR20:1;                   /**< \brief [20:20] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR21:1;                   /**< \brief [21:21] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR22:1;                   /**< \brief [22:22] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR23:1;                   /**< \brief [23:23] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR24:1;                   /**< \brief [24:24] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR25:1;                   /**< \brief [25:25] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR26:1;                   /**< \brief [26:26] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR27:1;                   /**< \brief [27:27] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR28:1;                   /**< \brief [28:28] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR29:1;                   /**< \brief [29:29] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR30:1;                   /**< \brief [30:30] Transmission Request n (n= 0-31) (rh) */
    unsigned int TXR31:1;                   /**< \brief [31:31] Transmission Request n (n= 0-31) (rh) */
} Ifx_ERAY_TXRQ1_Bits;

